import ../pastagen

original:
    """
У нас было 2 пакета травы, 75 таблеток мескалина, 5 упаковок кислоты, пол-солонки
кокаина и целое множество транквилизаторов всех сортов и расцветок, а также текила,
ром, ящик пива, пинта чистого эфира и амилнитрит. Не то чтобы это был необходимый
запас для поездки. Но если начал собирать дурь, становится трудно остановиться.
Единственное что вызывало у меня опасение - это эфир. Нет ничего более беспомощного,
безответственного и испорченного, чем эфирные зомби. Я знал, что рано или поздно мы
перейдем и на эту дрянь.
    """

subs:
    "пакета травы" -> "отдела"
    "таблеток мескалина" -> "отличных библиотек"
    "упаковок кислоты" -> "высококлассных специалистов"
    "пол-солонки" -> "полгода"
    "кокаина" -> "на первый релиз"
    "транквилизаторов" -> "навороченных IDE"
    "текила" -> "nanomsg"
    "ром" -> "protobuf"
    "ящик пива" -> "стопка блокнотов"
    "пинта чистого эфира" -> "набор оттестированных макросов на чистом C"
    "амилнитрит" -> "git"
    "поездки" -> "разработки нового проекта"
    "собирать дурь" -> "писать говнокод"
    "эфир" -> "макросы"
    "эфирные зомби" -> "программисты в поисках падения на стеке"

printMyPasta()
